import React from 'react';
import { Link } from 'react-router-dom';
import "./Home.css";

const Home = () => {
    return (
        <div className='p-5 lg:p-20 md:p-10 align-center flex flex-col'>
            <h1>
                আসসালামুয়ালাইকুম, প্রগতি প্রজেক্ট এ স্বাগতম।
            </h1>
            <p>
                নিজের তৈরি প্রশ্ন জমা দিতে <Link to={"/form"} className='bg-black text-white'>এখানে</Link> চাপুন
            </p>
            <p>
                এখানে আপনার বানানো প্রশ্ন ডাটাবেইজে রাখা হবে, যাতে পরে সেটা দিয়ে পরীক্ষার প্রশ্ন বানানো যায়। আপনার মতো হাজার হাজার শিক্ষার্থীর প্রশ্ন দিয়ে ডাটাবেইজ গঠনের পর সেটা থেকে পরীক্ষা নেয়া হবে, অবশ্যি প্রশ্নের মান আগে যাচাই করা হবে।
                এই ওয়েবসাইট ও এর প্রচেষ্টা আপাতত একটি বদ্ধ সোর্স তবে বিনামূল্য প্রজেক্ট। <br />
                এর উদ্দেশ্য হলো ফ্রি তে বাংলাদেশী কারিকুলামের প্রশ্ন ভান্ডার তৈরি করা ও পরীক্ষার আয়োজন করা। এখানে প্রায় যেকোনো ক্লাসের যেকোনো বিষয়ের উপর প্রশ্ন সংগ্রহ করা হবে এবং তা দিয়ে পরীক্ষা গ্রহণ করা হবে ভবিষ্যতে। শিক্ষা যেমন মুক্ত হওয়া উচিৎ, তেমনই উচ্চ মানের পরীক্ষা দেওয়া, প্রশ্ন তৈরি ও প্রশ্ন যাচাই করার একটি মুক্ত প্লাটফর্ম থাকা উচিৎ। আজ হয়তো কেবল বাংলাদেশের শিক্ষার্থীদের নিয়ে কাজ করতে হচ্ছে। যেকোনো প্রশ্ন বা তার উত্তর জানতে <a href="https://www.fb.com/abartoha" className='bg-black text-white'>আমার</a> ফেসবুক আইডিতে যোগাযোগ করতে পারেন।
            </p>
            <p>
                আপাতত কেবলমাত্র নিজের থেকে প্রশ্ন যোগ করা ব্যতীত অন্য কিছু করার ফাংশন তৈরি করিনি। ইনশাল্লাহ করবো। আপাতত এটুকুতেই খুশি থাকতে হবে। তবে বেশি দিন লাগবেনা, আর ১ মাস পর যখন ডাটাবেস স্ট্রং হবে তখন থেকে নিজেদের প্রশ্ন এম্রামত করা সহ আরো অনেক ফিচার যোগ করা হবে। 
            </p>
        </div>
    );
};
export default Home;